Tekla Open API Reference for Tekla Structures 2025
Intersection.LineSegmentToObb Method
 Returns a new line segment which is an intersection of the given line segment and the oriented bounding box or null if the line segment and oriented bounding box do not intersect.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static LineSegment LineSegmentToObb(
	LineSegment lineSegment,
	OBB obb
)
Public Shared Function LineSegmentToObb (
	lineSegment As LineSegment,
	obb As OBB
) As LineSegment
Parameters
lineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
Line segment to be used.
obb
Type: Tekla.Structures.Geometry3d.OBB
Oriented bounding box to be used.
Return Value
Type: LineSegment
The intersection line segment or null if no intersection was found.
See Also
Reference
Intersection Class
Tekla.Structures.Geometry3d Namespace